       01  EC01CP.                                                      00010000
           05  LK-DATE-OUT      PIC X(8).                               00020000
           05  LK-SPACE-OUT     PIC X(1).                               00030000
           05  LK-TIME-OUT      PIC X(8).                               00040000
           05  LK-LOWVAL-OUT    PIC X(1).                               00050000