       01  EC01CPAR.                                                    00010000
           05  NOMBRE-APELLIDO OCCURS 3 TIMES.                          00017002
               10 NAME       PIC X(20).                                 00018001
               10 APELLIDO   PIC X(20).                                 00019001